; domain
(define (domain domain1)
    (:requirements :strips :typing:negative-preconditions)
    (:types 
        person 
        robot 
        crane
        box 
        location 
        item
    )
; push from container
    (:predicates 
        ; (is_empty_b ?b - box) ;; box b is empty
        ; (is_full ?b - box) ;; box b is full
        (at_b ?b - box ?l - location) ;; box b is at location l 
        (at_p ?p - person ?l - location) ;; person p is at location l
        (at_r ?r - robot ?l - location) ;; robot r is at location l
        (at_i ?i - item ?l - location)  ;; item i is at location i
        (inside ?i - item ?b - box)   ;; item i is inside box b
        (is_empty_c ?c - crane) ;; crane c is empty
        (holding_box ?c - crane ?b - box) ;; crane c holds box b
        (holding_item ?c - crane ?i - item)
        (is_food ?i - item) ;; item i is food
        (is_medicine ?i - item) ;; item i is medicine
        (is_tool ?i - item) ;; item i is tools
        (need_food ?p - person) ;; person p need food
        (need_medicine ?p - person) ;; person p need medicine
        (need_tool ?p - person) ;; person p need tool
    )

    (:action move_robot_with_box 
      :parameters (?r - robot ?from ?to - location ?c - crane ?b - box)
      :precondition (and (at_r ?r ?from) (holding_box ?c ?b) (not (at_r ?r ?to)))
      :effect (and (at_r ?r ?to)
                (not (at_r ?r ?from)))
            )

    (:action move_robot_without_box
      :parameters (?r - robot ?from ?to - location ?c - crane)
      :precondition (and (at_r ?r ?from) (is_empty_c ?c) (not (at_r ?r ?to)))
      :effect (and (at_r ?r ?to)
                (not (at_r ?r ?from)))
            )

    (:action pickup_box
      :parameters (?b - box ?r - robot ?c - crane ?l - location)
      :precondition (and (at_r ?r ?l) (at_b ?b ?l) (is_empty_c ?c))
      :effect (and (holding_box ?c ?b) (not (is_empty_c ?c)) (not(at_b ?b ?l)))
    )

    (:action pickdown_box
      :parameters (?b - box ?r - robot ?c - crane ?l - location)
      :precondition (and (holding_box ?c ?b) (at_r ?r ?l))
      :effect (and (at_b ?b ?l) (is_empty_c ?c) (not (holding_box ?c ?b)))
    )
    

    (:action pickup_item_from_location
      :parameters (?i - item ?l - location ?c - crane ?r - robot)
      :precondition (and (at_r ?r ?l) (at_i ?i ?l) (is_empty_c ?c))
      :effect (and (not(at_i ?i ?l)) (not (is_empty_c ?c)) (holding_item ?c ?i))
    )

    (:action put_item_in_box
      :parameters (?i - item ?b - box ?l - location ?c - crane ?r - robot)
      :precondition (and (holding_item ?c ?i) (at_b ?b ?l) (at_r ?r ?l))
      :effect (and (inside ?i ?b) (not(at_i ?i ?l)) (is_empty_c ?c) (not(holding_item ?c ?i)))
    )


    (:action pick_item_from_box
      :parameters (?i - item ?b - box ?l - location ?c - crane ?r - robot)
      :precondition (and (at_b ?b ?l) (at_r ?r ?l) (is_empty_c ?c) (inside ?i ?b))
      :effect (and (holding_item ?c ?i) (not (inside ?i ?b)) (not(is_empty_c ?c)))
    )


    (:action pickdown_food
      :parameters (?i - item ?l - location ?c - crane ?r - robot ?p - person)
      :precondition (and 
                        (need_food ?p) 
                        (is_food ?i)
                        (at_p ?p ?l)
                        (at_r ?r ?l)
                        (holding_item ?c ?i)
                    )
      :effect (and  (not(need_food ?p))
                    (is_empty_c ?c)
                    (not(holding_item ?c ?i)))
	   				) 
  

    (:action pickdown_tool
      :parameters (?i - item ?l - location ?c - crane ?r - robot ?p - person)
      :precondition (and 
                        (need_tool ?p) 
                        (is_tool ?i)
                        (at_p ?p ?l)
                        (at_r ?r ?l)
                        (holding_item ?c ?i)
                    )
      :effect (and  (not(need_tool ?p))
                    (is_empty_c ?c)
                    (not(holding_item ?c ?i))
	   				) 
      
	)
    (:action pickdown_medicine
      :parameters (?i - item ?l - location ?c - crane ?r - robot ?p - person)
      :precondition (and 
                        (need_medicine ?p) 
                        (is_medicine ?i)
                        (at_p ?p ?l)
                        (at_r ?r ?l)
                        (holding_item ?c ?i)
                    )
      :effect (and  (not(need_medicine ?p))
                    (is_empty_c ?c)
                    (not(holding_item ?c ?i))
	   				) 
)
)

; problem
(define (problem problem_example) (:domain domain1)
(:objects 
    r1 - robot
    c1 - crane
    p1 - person
    p2 - person
    i1 - item
    i2 - item
    i3 - item
    i4 - item
    i5 - item
    i6 - item
    b1 - box
    b2 - box
    b3 - box
    l1 - location 
    l2 - location 
    l3 - location   
)

(:init
    (at_r r1 l1)
    (at_b b1 l1)
    (at_b b2 l1)
    (at_b b3 l1)
    (at_i i1 l1)
    (at_i i2 l1)
    (at_i i3 l1)
    (at_i i4 l1)
    (at_i i5 l1)
    (at_i i6 l1)
    (at_p p1 l2)
    (at_p p2 l2)
    (is_food i1)
    (is_medicine i2)
    (is_tool i3)
    (is_food i4)
    (is_medicine i5)
    (is_tool i6)
    (need_food p1)
    (need_medicine p1)
    (need_tool p1)
    (need_food p2)
    (need_medicine p2)
    (need_tool p2)
    ; (is_empty_b b1)
    (is_empty_c c1)
)

(:goal  (and
            (not(need_food p1))
            (not(need_medicine p1))
            (not(need_tool p1))
            (not(need_food p2))
            (not(need_medicine p2))
            (not(need_tool p2))
        )

)
)
;; planutils run downward "--alias lama-first domain1.pddl problem1.pddl"
;; remove the "" if you donot need it 
;un-comment the following line if metric is needed
;(:metric minimize (???))

; plan
1. (pickup_item_from_location i4 l1 c1 r1)
   deleted: (at_i i4 l1) (is_empty_c c1)
   added: (holding_item c1 i4)
   goals met: 0 of 6
2. (put_item_in_box i4 b3 l1 c1 r1)
   deleted: (holding_item c1 i4)
   added: (inside i4 b3) (is_empty_c c1)
   goals met: 0 of 6
3. (pickup_item_from_location i5 l1 c1 r1)
   deleted: (at_i i5 l1) (is_empty_c c1)
   added: (holding_item c1 i5)
   goals met: 0 of 6
4. (put_item_in_box i5 b3 l1 c1 r1)
   deleted: (holding_item c1 i5)
   added: (inside i5 b3) (is_empty_c c1)
   goals met: 0 of 6
5. (pickup_item_from_location i6 l1 c1 r1)
   deleted: (at_i i6 l1) (is_empty_c c1)
   added: (holding_item c1 i6)
   goals met: 0 of 6
6. (put_item_in_box i6 b3 l1 c1 r1)
   deleted: (holding_item c1 i6)
   added: (inside i6 b3) (is_empty_c c1)
   goals met: 0 of 6
7. (pickup_item_from_location i1 l1 c1 r1)
   deleted: (at_i i1 l1) (is_empty_c c1)
   added: (holding_item c1 i1)
   goals met: 0 of 6
8. (put_item_in_box i1 b3 l1 c1 r1)
   deleted: (holding_item c1 i1)
   added: (inside i1 b3) (is_empty_c c1)
   goals met: 0 of 6
9. (pickup_item_from_location i2 l1 c1 r1)
   deleted: (at_i i2 l1) (is_empty_c c1)
   added: (holding_item c1 i2)
   goals met: 0 of 6
10. (put_item_in_box i2 b3 l1 c1 r1)
   deleted: (holding_item c1 i2)
   added: (inside i2 b3) (is_empty_c c1)
   goals met: 0 of 6
11. (pickup_item_from_location i3 l1 c1 r1)
   deleted: (at_i i3 l1) (is_empty_c c1)
   added: (holding_item c1 i3)
   goals met: 0 of 6
12. (put_item_in_box i3 b3 l1 c1 r1)
   deleted: (holding_item c1 i3)
   added: (inside i3 b3) (is_empty_c c1)
   goals met: 0 of 6
13. (pickup_box b3 r1 c1 l1)
   deleted: (is_empty_c c1) (at_b b3 l1)
   added: (holding_box c1 b3)
   goals met: 0 of 6
14. (move_robot_with_box r1 l1 l2 c1 b3)
   deleted: (at_r r1 l1)
   added: (at_r r1 l2)
   goals met: 0 of 6
15. (pickdown_box b3 r1 c1 l2)
   deleted: (holding_box c1 b3)
   added: (at_b b3 l2) (is_empty_c c1)
   goals met: 0 of 6
16. (pick_item_from_box i4 b3 l2 c1 r1)
   deleted: (inside i4 b3) (is_empty_c c1)
   added: (holding_item c1 i4)
   goals met: 0 of 6
17. (pickdown_food i4 l2 c1 r1 p1)
   deleted: (need_food p1) (holding_item c1 i4)
   added: (is_empty_c c1)
   goals met: 1 of 6
18. (pick_item_from_box i1 b3 l2 c1 r1)
   deleted: (inside i1 b3) (is_empty_c c1)
   added: (holding_item c1 i1)
   goals met: 1 of 6
19. (pickdown_food i1 l2 c1 r1 p2)
   deleted: (need_food p2) (holding_item c1 i1)
   added: (is_empty_c c1)
   goals met: 2 of 6
20. (pick_item_from_box i2 b3 l2 c1 r1)
   deleted: (inside i2 b3) (is_empty_c c1)
   added: (holding_item c1 i2)
   goals met: 2 of 6
21. (pickdown_medicine i2 l2 c1 r1 p1)
   deleted: (need_medicine p1) (holding_item c1 i2)
   added: (is_empty_c c1)
   goals met: 3 of 6
22. (pick_item_from_box i5 b3 l2 c1 r1)
   deleted: (inside i5 b3) (is_empty_c c1)
   added: (holding_item c1 i5)
   goals met: 3 of 6
23. (pickdown_medicine i5 l2 c1 r1 p2)
   deleted: (need_medicine p2) (holding_item c1 i5)
   added: (is_empty_c c1)
   goals met: 4 of 6
24. (pick_item_from_box i3 b3 l2 c1 r1)
   deleted: (inside i3 b3) (is_empty_c c1)
   added: (holding_item c1 i3)
   goals met: 4 of 6
25. (pickdown_tool i3 l2 c1 r1 p1)
   deleted: (need_tool p1) (holding_item c1 i3)
   added: (is_empty_c c1)
   goals met: 5 of 6
26. (pick_item_from_box i6 b3 l2 c1 r1)
   deleted: (inside i6 b3) (is_empty_c c1)
   added: (holding_item c1 i6)
   goals met: 5 of 6
27. (pickdown_tool i6 l2 c1 r1 p2)
   deleted: (need_tool p2) (holding_item c1 i6)
   added: (is_empty_c c1)
   goals met: 6 of 6
